Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    // special handler
    asm("labe_apply_pwr_level__special:");
    asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
    asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_17
    asm("goto labe_apply_pwr_level__pre_max_level");
    //

    asm("labe_apply_pwr_level__d21_c3:");
    asm("movlw 2");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w");
    //
    asm("btfsc 5," AUX_STRINGIFY(PROJ_BIT_NUM_OUT_PWM_0)); // check if we came here from pwr MAX - then pre-apply 0
    asm("goto labe_apply_pwr_level__special");
    //
    // ----- generic 21
    asm("labe_apply_pwr_level__pre_max_level:");
    asm("labe_apply_pwr_level__d21_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_19
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_14
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d21_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_19
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__post_max:");
    asm("decf _pwr_level,f"); // edge handling
    asm("labe_apply_pwr_level__max:");
        PROJ_SET_GPIO_CAPON_PWMON
        asm("return");
}

void main() {
    TRISIO = ((1 << PROJ_BIT_NUM_OUT_PWM_0)
            | (1 << PROJ_BIT_NUM_OUT_PWM_1)
            | (1 << PROJ_BIT_NUM_OUT_CAP)
#ifdef PROJ_BIT_NUM_OUT_INV_PWM
            | (1 << PROJ_BIT_NUM_OUT_INV_PWM)
#endif
            ) ^ 0x3F
            ;
    ANSEL = (PROJ_ADC_ADCS << 4) | (1 << PROJ_ADC_CH_VOL); // set conversion time and ADC channel

    asm("bcf 3,5"); // ensure bank0 selected
    PROJ_SET_GPIO_CAPON_PWMOFF // initial assignment

    CMCON = 0x07;
    WPU = 0xFF; // all possible pullups
    OSCCAL = __osccal_val();

    is_prev_cycle_pwr = 0;

    app_flags = 0;

    OPTION_REG = (PROJ_TMR_PRESCALE); // (!nGPPU - enable pullups), prescaler setup
    TMR0 = 0;
    INTCON = 0x00; // no interrupts, run timer0

    asm("bcf 3,5"); // ensure bank0 selected
    PROJ_ADC_SETUP__WHEN_BANK0()
    AUX_DELAY_40
    PROJ_ADC_START()
    PROJ_ADC_WAIT("labe_preinit_adc_min_voltage")
    asm("movf 30,w"); // w = ADRESH
    asm("movwf _thr_min"); // thr_min = w (ADC result)

    // TODO revise thr_min? in case of having very high startup current (connecting to high-saturated solar; which would drive thr_min too high)
    // this is probably not necessary with 'PWRTE = OFF' as startup time is very small. TODO calculate/verify
    if((thr_min + (3 + PROJ_THR_DIFF_INSTANT_DROPOUT)) > thr_min) { // +1% +dropout. ensure no overflow
        // must be no overflow - otherwise it's mistake in scheme or ADC failure
        thr_min += (3 + PROJ_THR_DIFF_INSTANT_DROPOUT);
    }

    // pre-init raw adc with pre-wait 1 second
    asm("bcf 3,5"); // ensure bank0 selected
    {
        asm("main__time_waiter:");
        asm("btfss " LOCATION__INTCONbits_T0IF);
        asm("goto main__time_waiter");
        asm("bcf " LOCATION__INTCONbits_T0IF);
        asm("decfsz _timer_multiplier,f");
        asm("goto main__time_waiter");
            asm("movlw " AUX_STRINGIFY(PROJ_TIMER_MULTIPLIER));
            asm("movwf _timer_multiplier");
    }
    {
        PROJ_SET_GPIO_CAPON_PWMOFF
        PROJ_SET_GPIO_CAPOFF_PWMOFF

        asm("fcall _fast_RunADC_8_rising");
        asm("movf 30,w"); // w = ADRESH (ADC result)
        asm("movwf _last_raw_adc_val");

        asm("bsf _gp_shadow," AUX_STRINGIFY(PROJ_BIT_NUM_OUT_CAP));
        asm("movf _gp_shadow,w");
        asm("movwf 5"); // attach capacitor
    }
    {
        //asm("bcf 3,5"); // ensure bank0 selected
        asm("movf _last_raw_adc_val,w");
        asm("fcall _fast_mul_8x8");

        asm("movf _fast_mul_8x8_res_h,w");
        asm("movwf _thr_hi"); // thr_hi = last_raw_adc_val * g_thr / 256
        //
        asm("subwf _thr_min,w"); // w(thr_hi) = thr_min - w ; if borrow - no action
        asm("skipnc"); // skip next if borrow
        asm("addwf _thr_hi,f"); // thr_hi += (thr_min - thr_hi)
        //
        asm("movlw " AUX_STRINGIFY(PROJ_THR_DIFF_INSTANT_DROPOUT));
        asm("subwf _thr_hi,w"); // w = thr_hi - PROJ_THR_DIFF_INSTANT_DROPOUT
        asm("movwf _thr_lo");
    }
    //

#define VAR_ADCVAL "30" // avoid copying ADC result to minimize executed code

    PROJ_ADC_START()
    AUX_DELAY_3 // align with cycle internal delays
    asm("labe_main__cycle:");
        PROJ_SKIP_IF_LIMIT_NOTREACHED
        asm("goto labe_main__cycle_handle_limit_pocket");
            // else - limit not reached
            asm("bsf _is_prev_cycle_pwr,0");
            asm("incf _pwr_level,f"); // pre-increment (will either stay incremented...)
            asm("movf _thr_hi,w"); // w = thr_hi
            // ADC has finished by this point - commands between launching ADC and using result execute 8 tacts, so 9 tacts (36Tosc) inbetween
            asm("subwf " VAR_ADCVAL ",w"); // w = adcval - thr_hi
            asm("movlw 2"); // doesn't affect status
            asm("skipc"); // c == no borrow
            asm("subwf _pwr_level,f"); // pwr_level = pwr_level - w(2) (...or will be decremented)
            // TODO consider higher drop-offs as some short-circut handling/more aggressive balancing?

            asm("fcall _apply_pwr_level");
            // main part done


        asm("labe_main__cycle_pre_check_flags:");
        PROJ_ADC_START()
        asm("btfss " LOCATION__INTCONbits_T0IF);
        asm("goto labe_main__cycle");
        asm("btfsc _app_flags," AUX_STRINGIFY(PROJ_APP_FLAG_T0IF_RETURN_TRAP));
        asm("return");

