Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
        asm("decfsz _timer_multiplier,f"); // TODO consider timer1 for shorter code
        asm("goto labe_main__cycle_timer_unlocker");
            asm("movlw " AUX_STRINGIFY(PROJ_TIMER_MULTIPLIER));
            asm("movwf _timer_multiplier");

        asm("bsf _app_flags," AUX_STRINGIFY(PROJ_APP_FLAG_T0IF_RETURN_TRAP));
        // measure/update raw voltage
        PROJ_SET_GPIO_CAPON_PWMOFF
        PROJ_SET_GPIO_CAPOFF_PWMOFF
        // detached cap, give some time to establish raw voltage
        asm("fcall _fast_RunADC_8_rising");
        PROJ_SET_GPIO_CAPON_PWMOFF // attach capacitor back
        // save result
        asm("movf 30,w"); // w = ADRESH (ADC result)
        asm("movwf _pending_raw_adc_val");
        //// measured; run a cycle to minimize delay gap
            PROJ_ADC_START()
            AUX_DELAY_1
            asm("fcall labe_main__cycle");
        //// refresh thr if needed
        asm("movf _pending_raw_adc_val,w"); // TODO input1 can be union with last_raw_adc_val to save 2 commands
        asm("xorwf _last_raw_adc_val,w");
        asm("skipnz");
        asm("goto labe_main__cycle_flags_done"); // no changes
        // different - needs recalculation

        asm("clrf _fast_mul_8x8_res_h");
        asm("clrf _fast_mul_8x8_res_l");
            //// run cycle - minimize difference in delays
            PROJ_ADC_START()
            AUX_DELAY_1 // align delays
            asm("fcall labe_main__cycle");
            ////

        asm("movf _pending_raw_adc_val,w");
        asm("movwf _last_raw_adc_val");
        // inlined multiplication
        #if (PROJ_CONST_THR & 0x80)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
        #endif
        #if (PROJ_CONST_THR & 0x40)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 6, pre 5
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
            //// run cycle - minimize difference in delays
            PROJ_ADC_START()
            AUX_DELAY_1 // align delays
            asm("fcall labe_main__cycle");
            asm("movf _pending_raw_adc_val,w"); // recover W
            ////
        #if (PROJ_CONST_THR & 0x20)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 5, pre 4
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
        #if (PROJ_CONST_THR & 0x10)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 4, pre 3
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
        #if (PROJ_CONST_THR & 0x08)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 3, pre 2
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
        #if (PROJ_CONST_THR & 0x04)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 2, pre 1
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
            //// run cycle - minimize difference in delays
            PROJ_ADC_START()
            AUX_DELAY_1 // align delays
            asm("fcall labe_main__cycle");
            asm("movf _pending_raw_adc_val,w"); // recover W
            ////
        #if (PROJ_CONST_THR & 0x02)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
                asm("clrc"); // post 1, pre 0
                asm("rlf _fast_mul_8x8_res_l,f");
                asm("rlf _fast_mul_8x8_res_h,f");
        #if (PROJ_CONST_THR & 0x01)
            asm("addwf _fast_mul_8x8_res_l,f");
            asm("skipnc");
            asm("incf _fast_mul_8x8_res_h");
        #endif
        // end ------------------
        asm("movf _fast_mul_8x8_res_h,w");
        asm("movwf _thr_hi"); // thr_hi = last_raw_adc_val * g_thr / 256

        asm("subwf _thr_min,w"); // w(thr_hi) = thr_min - w ; if borrow - no action
        asm("skipnc"); // skip next if borrow
        asm("addwf _thr_hi,f"); // thr_hi += (thr_min - thr_hi)

            //// run cycle - minimize difference in delays
            PROJ_ADC_START()
            AUX_DELAY_1 // align delays
            asm("fcall labe_main__cycle");
            ////

        asm("movlw " AUX_STRINGIFY(PROJ_THR_DIFF_INSTANT_DROPOUT));
        asm("subwf _thr_hi,w"); // w = thr_hi - PROJ_THR_DIFF_INSTANT_DROPOUT
        asm("movwf _thr_lo");
        //

        // ---------------------------------
        asm("labe_main__cycle_flags_done:");
        asm("bcf _app_flags," AUX_STRINGIFY(PROJ_APP_FLAG_T0IF_RETURN_TRAP));
        asm("labe_main__cycle_timer_unlocker:");
        PROJ_ADC_START()
        asm("bcf " LOCATION__INTCONbits_T0IF);
        asm("goto labe_main__cycle");

        // ------------------------------------------
        asm("labe_main__cycle_handle_limit_pocket:");
            PROJ_SET_GPIO_CAPON_PWMOFF // ensure output is off (in case we're at max level)
            asm("btfss _is_prev_cycle_pwr,0");
            asm("goto labe_main__cycle_pre_check_flags");
                asm("decf _pwr_level"); // decrement pwr level
                // ADC result is ready by this moment
                asm("movf _thr_hi,w"); // w = thr_hi
                asm("subwf " VAR_ADCVAL ",w"); // w = adcval - thr_hi
                asm("skipnc"); // nc == borrow
                asm("decf _pwr_level"); // decrement again if adcval >= thr_hi; as it will very likely be incremented on next cycle
                // check underflow - ensure minimal pwr_level is 1 after this block
                asm("decf _pwr_level"); // ---
                asm("btfsc _pwr_level,7"); // test msb
                asm("clrf _pwr_level"); // if underflowed - reset
                asm("incf _pwr_level"); // ---
            asm("bcf _is_prev_cycle_pwr,0");
            asm("goto labe_main__cycle_pre_check_flags");
} //



asm("global _aux_version_info_footer");
void aux_version_info_footer(void) __at(0x03FF - 5) {
    asm("retlw " AUX_STRINGIFY(FW_VER_MAJOR));
    asm("retlw " AUX_STRINGIFY(FW_VER_MINOR));
    asm("retlw " AUX_STRINGIFY(FW_VER_THR));
    asm("retlw " AUX_STRINGIFY(FW_VER_OPTION));
    // 'return' is auto-generated here so 1 last byte is skipped to ensure it won't erase OSCCAL
}
